In [3]:
import pandas as pd
import math
trip_data = pd.read_csv('data/trip.csv')

In [227]:
# display current data
trip_data

     City  Return flight  Hotel per day  Weekly car rental
0   Paris            200             20                200
1  London            250             30                120
2   Dubai            370             15                 80
3  Mumbai            450             10                 70

In [27]:
# Gets the cheapest city according to a specific duration of days.

def getCheapestCity(duration):
    # copies current data to avoid changes in original, preserve visualization
    data = trip_data.copy()

    # set week duration according to days
    weeks=duration / 7

    # set total cost column
    data['Total Cost'] = data['Return flight'] + data['Hotel per day']*duration + data['Weekly car rental']*weeks
    
    # gets the minimum value in total cost
    min_index = data['Total Cost'].idxmin()

    # Locates the cheapest cities based on minimum total cost
    cheapest_city = data.loc[min_index, ['City', 'Total Cost']].to_frame().transpose()

    return cheapest_city.reset_index(drop=True)

In [6]:
# Based on given budget, determine cities to maximize your duration there and display city + ceiled duration in days
def maximizeByBudget(budget):
        # copies current data to avoid changes in original, preserve visualization
        data = trip_data.copy()
        data['Total Cost'] = data['Return flight'] + data['Hotel per day'] * 7 + data['Weekly car rental']

        # calculates duration based on budget, multiplies the remaining week for days and ceil it
        data['Duration'] = ((budget / data['Total Cost']) * 7).apply(math.ceil)

        # get cities with maximized duration
        max_duration = data['Duration'].max()
        max_duration_cities = data[data['Duration'] == max_duration][['City', 'Duration']]

        return max_duration_cities

In [20]:
# Based on given budget, determine cities to minimize your duration there and display city + ceiled duration in days
def minimizeByBudget(budget):
        # copies current data to avoid changes in original, preserve visualization
        data = trip_data.copy()

        # sets total cost for 1 week
        data['Total Cost'] = data['Return flight'] + data['Hotel per day'] * 7 + data['Weekly car rental']

        # calculates duration based on budget, multiplies the remaining week for days and ceil it
        data['Duration'] = ((budget / data['Total Cost']) * 7).apply(math.ceil)

        # get cities with minimized duration
        min_duration = data['Duration'].min()
        min_duration_cities = data[data['Duration'] == min_duration][['City', 'Duration']]

        return min_duration_cities

In [28]:
getCheapestCity(7)

    City Total Cost
0  Paris      540.0

In [29]:
getCheapestCity(14)

     City Total Cost
0  Mumbai      730.0

In [30]:
maximizeByBudget(1000)

     City  Duration
0   Paris        13
1  London        13
2   Dubai        13

In [32]:
maximizeByBudget(400)

    City  Duration
0  Paris         6
2  Dubai         6

In [33]:
minimizeByBudget(2500)

     City  Duration
3  Mumbai        30

In [35]:
minimizeByBudget(400)

     City  Duration
1  London         5
3  Mumbai         5